Model: "model_17"
__________________________________________________________________________________________________
Layer (type)                    Output Shape         Param #     Connected to                     
==================================================================================================
the_input (InputLayer)          [(None, None, 26)]   0                                            
__________________________________________________________________________________________________
layer_1_conv (Conv1D)           (None, None, 200)    57400       the_input[0][0]                  
__________________________________________________________________________________________________
conv_batch_norm (BatchNormaliza (None, None, 200)    800         layer_1_conv[0][0]               
__________________________________________________________________________________________________
rnn_1 (GRU)                     (None, None, 250)    339000      conv_batch_norm[0][0]            
__________________________________________________________________________________________________
bt_rnn_1 (BatchNormalization)   (None, None, 250)    1000        rnn_1[0][0]                      
__________________________________________________________________________________________________
rnn_2 (GRU)                     (None, None, 250)    376500      bt_rnn_1[0][0]                   
__________________________________________________________________________________________________
bt_rnn_2 (BatchNormalization)   (None, None, 250)    1000        rnn_2[0][0]                      
__________________________________________________________________________________________________
rnn_3 (GRU)                     (None, None, 250)    376500      bt_rnn_2[0][0]                   
__________________________________________________________________________________________________
bt_rnn_3 (BatchNormalization)   (None, None, 250)    1000        rnn_3[0][0]                      
__________________________________________________________________________________________________
rnn_4 (GRU)                     (None, None, 250)    376500      bt_rnn_3[0][0]                   
__________________________________________________________________________________________________
bt_rnn_4 (BatchNormalization)   (None, None, 250)    1000        rnn_4[0][0]                      
__________________________________________________________________________________________________
final_layer_of_rnn (GRU)        (None, None, 250)    376500      bt_rnn_4[0][0]                   
__________________________________________________________________________________________________
bt_rnn_final (BatchNormalizatio (None, None, 250)    1000        final_layer_of_rnn[0][0]         
__________________________________________________________________________________________________
time_distributed_10 (TimeDistri (None, None, 29)     7279        bt_rnn_final[0][0]               
__________________________________________________________________________________________________
input_length (InputLayer)       [(None, 1)]          0                                            
__________________________________________________________________________________________________
softmax (Activation)            (None, None, 29)     0           time_distributed_10[0][0]        
__________________________________________________________________________________________________
the_labels (InputLayer)         [(None, None)]       0                                            
__________________________________________________________________________________________________
lambda_6 (Lambda)               (None, 1)            0           input_length[0][0]               
__________________________________________________________________________________________________
label_length (InputLayer)       [(None, 1)]          0                                            
__________________________________________________________________________________________________
ctc (Lambda)                    (None, 1)            0           softmax[0][0]                    
                                                                 the_labels[0][0]                 
                                                                 lambda_6[0][0]                   
                                                                 label_length[0][0]               
==================================================================================================
Total params: 1,915,479
Trainable params: 1,912,579
Non-trainable params: 2,900
__________________________________________________________________________________________________