Model: "model_1"
__________________________________________________________________________________________________
Layer (type)                    Output Shape         Param #     Connected to                     
==================================================================================================
the_input (InputLayer)          [(None, None, 13)]   0                                            
__________________________________________________________________________________________________
layer_1_conv (Conv1D)           (None, None, 200)    28800       the_input[0][0]                  
__________________________________________________________________________________________________
conv_batch_norm (BatchNormaliza (None, None, 200)    800         layer_1_conv[0][0]               
__________________________________________________________________________________________________
rnn_1 (GRU)                     (None, None, 15)     9765        conv_batch_norm[0][0]            
__________________________________________________________________________________________________
bt_rnn_1 (BatchNormalization)   (None, None, 15)     60          rnn_1[0][0]                      
__________________________________________________________________________________________________
rnn_2 (GRU)                     (None, None, 15)     1440        bt_rnn_1[0][0]                   
__________________________________________________________________________________________________
bt_rnn_2 (BatchNormalization)   (None, None, 15)     60          rnn_2[0][0]                      
__________________________________________________________________________________________________
rnn_3 (GRU)                     (None, None, 15)     1440        bt_rnn_2[0][0]                   
__________________________________________________________________________________________________
bt_rnn_3 (BatchNormalization)   (None, None, 15)     60          rnn_3[0][0]                      
__________________________________________________________________________________________________
rnn_4 (GRU)                     (None, None, 15)     1440        bt_rnn_3[0][0]                   
__________________________________________________________________________________________________
bt_rnn_4 (BatchNormalization)   (None, None, 15)     60          rnn_4[0][0]                      
__________________________________________________________________________________________________
final_layer_of_rnn (GRU)        (None, None, 15)     1440        bt_rnn_4[0][0]                   
__________________________________________________________________________________________________
bt_rnn_final (BatchNormalizatio (None, None, 15)     60          final_layer_of_rnn[0][0]         
__________________________________________________________________________________________________
time_distributed (TimeDistribut (None, None, 55)     880         bt_rnn_final[0][0]               
__________________________________________________________________________________________________
input_length (InputLayer)       [(None, 1)]          0                                            
__________________________________________________________________________________________________
softmax (Activation)            (None, None, 55)     0           time_distributed[0][0]           
__________________________________________________________________________________________________
the_labels (InputLayer)         [(None, None)]       0                                            
__________________________________________________________________________________________________
lambda (Lambda)                 (None, 1)            0           input_length[0][0]               
__________________________________________________________________________________________________
label_length (InputLayer)       [(None, 1)]          0                                            
__________________________________________________________________________________________________
ctc (Lambda)                    (None, 1)            0           softmax[0][0]                    
                                                                 the_labels[0][0]                 
                                                                 lambda[0][0]                     
                                                                 label_length[0][0]               
==================================================================================================
Total params: 46,305
Trainable params: 45,755
Non-trainable params: 550
__________________________________________________________________________________________________