Model: "model_17"
__________________________________________________________________________________________________
Layer (type)                    Output Shape         Param #     Connected to                     
==================================================================================================
the_input (InputLayer)          [(None, None, 26)]   0                                            
__________________________________________________________________________________________________
conv1d (Conv1D)                 (None, None, 250)    169250      the_input[0][0]                  
__________________________________________________________________________________________________
bn_conv_1d (BatchNormalization) (None, None, 250)    1000        conv1d[0][0]                     
__________________________________________________________________________________________________
rnn (SimpleRNN)                 (None, None, 5)      1280        bn_conv_1d[0][0]                 
__________________________________________________________________________________________________
batch_normalization_5 (BatchNor (None, None, 5)      20          rnn[0][0]                        
__________________________________________________________________________________________________
time_distributed_6 (TimeDistrib (None, None, 29)     174         batch_normalization_5[0][0]      
__________________________________________________________________________________________________
input_length (InputLayer)       [(None, 1)]          0                                            
__________________________________________________________________________________________________
softmax (Activation)            (None, None, 29)     0           time_distributed_6[0][0]         
__________________________________________________________________________________________________
the_labels (InputLayer)         [(None, None)]       0                                            
__________________________________________________________________________________________________
lambda_10 (Lambda)              (None, 1)            0           input_length[0][0]               
__________________________________________________________________________________________________
label_length (InputLayer)       [(None, 1)]          0                                            
__________________________________________________________________________________________________
ctc (Lambda)                    (None, 1)            0           softmax[0][0]                    
                                                                 the_labels[0][0]                 
                                                                 lambda_10[0][0]                  
                                                                 label_length[0][0]               
==================================================================================================
Total params: 171,724
Trainable params: 171,214
Non-trainable params: 510
__________________________________________________________________________________________________