Model: "model_57"
__________________________________________________________________________________________________
Layer (type)                    Output Shape         Param #     Connected to                     
==================================================================================================
the_input (InputLayer)          [(None, None, 26)]   0                                            
__________________________________________________________________________________________________
conv1d (Conv1D)                 (None, None, 250)    26250       the_input[0][0]                  
__________________________________________________________________________________________________
bn_conv_1d (BatchNormalization) (None, None, 250)    1000        conv1d[0][0]                     
__________________________________________________________________________________________________
rnn (SimpleRNN)                 (None, None, 200)    90200       bn_conv_1d[0][0]                 
__________________________________________________________________________________________________
batch_normalization_25 (BatchNo (None, None, 200)    800         rnn[0][0]                        
__________________________________________________________________________________________________
time_distributed_26 (TimeDistri (None, None, 29)     5829        batch_normalization_25[0][0]     
__________________________________________________________________________________________________
input_length (InputLayer)       [(None, 1)]          0                                            
__________________________________________________________________________________________________
softmax (Activation)            (None, None, 29)     0           time_distributed_26[0][0]        
__________________________________________________________________________________________________
the_labels (InputLayer)         [(None, None)]       0                                            
__________________________________________________________________________________________________
lambda_30 (Lambda)              (None, 1)            0           input_length[0][0]               
__________________________________________________________________________________________________
label_length (InputLayer)       [(None, 1)]          0                                            
__________________________________________________________________________________________________
ctc (Lambda)                    (None, 1)            0           softmax[0][0]                    
                                                                 the_labels[0][0]                 
                                                                 lambda_30[0][0]                  
                                                                 label_length[0][0]               
==================================================================================================
Total params: 124,079
Trainable params: 123,179
Non-trainable params: 900
__________________________________________________________________________________________________