Model: "model_15"
__________________________________________________________________________________________________
Layer (type)                    Output Shape         Param #     Connected to                     
==================================================================================================
the_input (InputLayer)          [(None, None, 26)]   0                                            
__________________________________________________________________________________________________
conv1d (Conv1D)                 (None, None, 200)    57400       the_input[0][0]                  
__________________________________________________________________________________________________
bn_conv_1d (BatchNormalization) (None, None, 200)    800         conv1d[0][0]                     
__________________________________________________________________________________________________
rnn (SimpleRNN)                 (None, None, 200)    80200       bn_conv_1d[0][0]                 
__________________________________________________________________________________________________
batch_normalization_4 (BatchNor (None, None, 200)    800         rnn[0][0]                        
__________________________________________________________________________________________________
time_distributed_5 (TimeDistrib (None, None, 29)     5829        batch_normalization_4[0][0]      
__________________________________________________________________________________________________
input_length (InputLayer)       [(None, 1)]          0                                            
__________________________________________________________________________________________________
softmax (Activation)            (None, None, 29)     0           time_distributed_5[0][0]         
__________________________________________________________________________________________________
the_labels (InputLayer)         [(None, None)]       0                                            
__________________________________________________________________________________________________
lambda_9 (Lambda)               (None, 1)            0           input_length[0][0]               
__________________________________________________________________________________________________
label_length (InputLayer)       [(None, 1)]          0                                            
__________________________________________________________________________________________________
ctc (Lambda)                    (None, 1)            0           softmax[0][0]                    
                                                                 the_labels[0][0]                 
                                                                 lambda_9[0][0]                   
                                                                 label_length[0][0]               
==================================================================================================
Total params: 145,029
Trainable params: 144,229
Non-trainable params: 800
__________________________________________________________________________________________________