Model: "model_11"
__________________________________________________________________________________________________
Layer (type)                    Output Shape         Param #     Connected to                     
==================================================================================================
the_input (InputLayer)          [(None, None, 26)]   0                                            
__________________________________________________________________________________________________
layer_1_conv (Conv1D)           (None, None, 250)    26250       the_input[0][0]                  
__________________________________________________________________________________________________
conv_batch_norm (BatchNormaliza (None, None, 250)    1000        layer_1_conv[0][0]               
__________________________________________________________________________________________________
rnn_1 (GRU)                     (None, None, 250)    376500      conv_batch_norm[0][0]            
__________________________________________________________________________________________________
bt_rnn_1 (BatchNormalization)   (None, None, 250)    1000        rnn_1[0][0]                      
__________________________________________________________________________________________________
final_layer_of_rnn (GRU)        (None, None, 250)    376500      bt_rnn_1[0][0]                   
__________________________________________________________________________________________________
bt_rnn_final (BatchNormalizatio (None, None, 250)    1000        final_layer_of_rnn[0][0]         
__________________________________________________________________________________________________
time_distributed_5 (TimeDistrib (None, None, 29)     7279        bt_rnn_final[0][0]               
__________________________________________________________________________________________________
input_length (InputLayer)       [(None, 1)]          0                                            
__________________________________________________________________________________________________
softmax (Activation)            (None, None, 29)     0           time_distributed_5[0][0]         
__________________________________________________________________________________________________
the_labels (InputLayer)         [(None, None)]       0                                            
__________________________________________________________________________________________________
lambda_5 (Lambda)               (None, 1)            0           input_length[0][0]               
__________________________________________________________________________________________________
label_length (InputLayer)       [(None, 1)]          0                                            
__________________________________________________________________________________________________
ctc (Lambda)                    (None, 1)            0           softmax[0][0]                    
                                                                 the_labels[0][0]                 
                                                                 lambda_5[0][0]                   
                                                                 label_length[0][0]               
==================================================================================================
Total params: 789,529
Trainable params: 788,029
Non-trainable params: 1,500
__________________________________________________________________________________________________