Model: "model_4"
__________________________________________________________________________________________________
Layer (type)                    Output Shape         Param #     Connected to                     
==================================================================================================
the_input (InputLayer)          [(None, None, 26)]   0                                            
__________________________________________________________________________________________________
bidirectional_1 (Bidirectional) (None, None, 500)    417000      the_input[0][0]                  
__________________________________________________________________________________________________
norm_bidir_rnn (BatchNormalizat (None, None, 500)    2000        bidirectional_1[0][0]            
__________________________________________________________________________________________________
time_distributed_3 (TimeDistrib (None, None, 29)     14529       norm_bidir_rnn[0][0]             
__________________________________________________________________________________________________
input_length (InputLayer)       [(None, 1)]          0                                            
__________________________________________________________________________________________________
softmax (Activation)            (None, None, 29)     0           time_distributed_3[0][0]         
__________________________________________________________________________________________________
the_labels (InputLayer)         [(None, None)]       0                                            
__________________________________________________________________________________________________
lambda (Lambda)                 (None, 1)            0           input_length[0][0]               
__________________________________________________________________________________________________
label_length (InputLayer)       [(None, 1)]          0                                            
__________________________________________________________________________________________________
ctc (Lambda)                    (None, 1)            0           softmax[0][0]                    
                                                                 the_labels[0][0]                 
                                                                 lambda[0][0]                     
                                                                 label_length[0][0]               
==================================================================================================
Total params: 433,529
Trainable params: 432,529
Non-trainable params: 1,000
__________________________________________________________________________________________________