Model: "model_1"
__________________________________________________________________________________________________
Layer (type)                    Output Shape         Param #     Connected to                     
==================================================================================================
the_input (InputLayer)          [(None, None, 26)]   0                                            
__________________________________________________________________________________________________
layer_1_conv (Conv1D)           (None, None, 100)    10500       the_input[0][0]                  
__________________________________________________________________________________________________
conv_batch_norm (BatchNormaliza (None, None, 100)    400         layer_1_conv[0][0]               
__________________________________________________________________________________________________
bidirectional (Bidirectional)   (None, None, 500)    528000      conv_batch_norm[0][0]            
__________________________________________________________________________________________________
bt_rnn_1 (BatchNormalization)   (None, None, 500)    2000        bidirectional[0][0]              
__________________________________________________________________________________________________
bidirectional_1 (Bidirectional) (None, None, 500)    1128000     bt_rnn_1[0][0]                   
__________________________________________________________________________________________________
bt_rnn_2 (BatchNormalization)   (None, None, 500)    2000        bidirectional_1[0][0]            
__________________________________________________________________________________________________
bidirectional_2 (Bidirectional) (None, None, 500)    1128000     bt_rnn_2[0][0]                   
__________________________________________________________________________________________________
bt_rnn_final (BatchNormalizatio (None, None, 500)    2000        bidirectional_2[0][0]            
__________________________________________________________________________________________________
time_distributed (TimeDistribut (None, None, 29)     14529       bt_rnn_final[0][0]               
__________________________________________________________________________________________________
input_length (InputLayer)       [(None, 1)]          0                                            
__________________________________________________________________________________________________
softmax (Activation)            (None, None, 29)     0           time_distributed[0][0]           
__________________________________________________________________________________________________
the_labels (InputLayer)         [(None, None)]       0                                            
__________________________________________________________________________________________________
lambda (Lambda)                 (None, 1)            0           input_length[0][0]               
__________________________________________________________________________________________________
label_length (InputLayer)       [(None, 1)]          0                                            
__________________________________________________________________________________________________
ctc (Lambda)                    (None, 1)            0           softmax[0][0]                    
                                                                 the_labels[0][0]                 
                                                                 lambda[0][0]                     
                                                                 label_length[0][0]               
==================================================================================================
Total params: 2,815,429
Trainable params: 2,812,229
Non-trainable params: 3,200
__________________________________________________________________________________________________