Model: "model_55"
__________________________________________________________________________________________________
Layer (type)                    Output Shape         Param #     Connected to                     
==================================================================================================
the_input (InputLayer)          [(None, None, 26)]   0                                            
__________________________________________________________________________________________________
conv1d (Conv1D)                 (None, None, 250)    26250       the_input[0][0]                  
__________________________________________________________________________________________________
bn_conv_1d (BatchNormalization) (None, None, 250)    1000        conv1d[0][0]                     
__________________________________________________________________________________________________
rnn (SimpleRNN)                 (None, None, 200)    90200       bn_conv_1d[0][0]                 
__________________________________________________________________________________________________
batch_normalization_24 (BatchNo (None, None, 200)    800         rnn[0][0]                        
__________________________________________________________________________________________________
time_distributed_25 (TimeDistri (None, None, 28)     5628        batch_normalization_24[0][0]     
__________________________________________________________________________________________________
input_length (InputLayer)       [(None, 1)]          0                                            
__________________________________________________________________________________________________
softmax (Activation)            (None, None, 28)     0           time_distributed_25[0][0]        
__________________________________________________________________________________________________
the_labels (InputLayer)         [(None, None)]       0                                            
__________________________________________________________________________________________________
lambda_29 (Lambda)              (None, 1)            0           input_length[0][0]               
__________________________________________________________________________________________________
label_length (InputLayer)       [(None, 1)]          0                                            
__________________________________________________________________________________________________
ctc (Lambda)                    (None, 1)            0           softmax[0][0]                    
                                                                 the_labels[0][0]                 
                                                                 lambda_29[0][0]                  
                                                                 label_length[0][0]               
==================================================================================================
Total params: 123,878
Trainable params: 122,978
Non-trainable params: 900
__________________________________________________________________________________________________