Model: "model_2"
__________________________________________________________________________________________________
Layer (type)                    Output Shape         Param #     Connected to                     
==================================================================================================
the_input (InputLayer)          [(None, None, 26)]   0                                            
__________________________________________________________________________________________________
layer_1_conv (Conv1D)           (None, None, 100)    10500       the_input[0][0]                  
__________________________________________________________________________________________________
conv_batch_norm (BatchNormaliza (None, None, 100)    400         layer_1_conv[0][0]               
__________________________________________________________________________________________________
bidirectional (Bidirectional)   (None, None, 500)    528000      conv_batch_norm[0][0]            
__________________________________________________________________________________________________
bt_rnn_1 (BatchNormalization)   (None, None, 500)    2000        bidirectional[0][0]              
__________________________________________________________________________________________________
time_distributed (TimeDistribut (None, None, 29)     14529       bt_rnn_1[0][0]                   
__________________________________________________________________________________________________
input_length (InputLayer)       [(None, 1)]          0                                            
__________________________________________________________________________________________________
softmax (Activation)            (None, None, 29)     0           time_distributed[0][0]           
__________________________________________________________________________________________________
the_labels (InputLayer)         [(None, None)]       0                                            
__________________________________________________________________________________________________
lambda_1 (Lambda)               (None, 1)            0           input_length[0][0]               
__________________________________________________________________________________________________
label_length (InputLayer)       [(None, 1)]          0                                            
__________________________________________________________________________________________________
ctc (Lambda)                    (None, 1)            0           softmax[0][0]                    
                                                                 the_labels[0][0]                 
                                                                 lambda_1[0][0]                   
                                                                 label_length[0][0]               
==================================================================================================
Total params: 555,429
Trainable params: 554,229
Non-trainable params: 1,200
__________________________________________________________________________________________________