Model: "model_29"
__________________________________________________________________________________________________
Layer (type)                    Output Shape         Param #     Connected to                     
==================================================================================================
the_input (InputLayer)          [(None, None, 26)]   0                                            
__________________________________________________________________________________________________
conv1d (Conv1D)                 (None, None, 250)    13250       the_input[0][0]                  
__________________________________________________________________________________________________
bn_conv_1d (BatchNormalization) (None, None, 250)    1000        conv1d[0][0]                     
__________________________________________________________________________________________________
rnn (SimpleRNN)                 (None, None, 6)      1542        bn_conv_1d[0][0]                 
__________________________________________________________________________________________________
batch_normalization_11 (BatchNo (None, None, 6)      24          rnn[0][0]                        
__________________________________________________________________________________________________
time_distributed_12 (TimeDistri (None, None, 29)     203         batch_normalization_11[0][0]     
__________________________________________________________________________________________________
input_length (InputLayer)       [(None, 1)]          0                                            
__________________________________________________________________________________________________
softmax (Activation)            (None, None, 29)     0           time_distributed_12[0][0]        
__________________________________________________________________________________________________
the_labels (InputLayer)         [(None, None)]       0                                            
__________________________________________________________________________________________________
lambda_16 (Lambda)              (None, 1)            0           input_length[0][0]               
__________________________________________________________________________________________________
label_length (InputLayer)       [(None, 1)]          0                                            
__________________________________________________________________________________________________
ctc (Lambda)                    (None, 1)            0           softmax[0][0]                    
                                                                 the_labels[0][0]                 
                                                                 lambda_16[0][0]                  
                                                                 label_length[0][0]               
==================================================================================================
Total params: 16,019
Trainable params: 15,507
Non-trainable params: 512
__________________________________________________________________________________________________