Model: "model_8"
__________________________________________________________________________________________________
Layer (type)                    Output Shape         Param #     Connected to                     
==================================================================================================
the_input (InputLayer)          [(None, None, 26)]   0                                            
__________________________________________________________________________________________________
rnn (GRU)                       (None, None, 5)      495         the_input[0][0]                  
__________________________________________________________________________________________________
batch_normalization_1 (BatchNor (None, None, 5)      20          rnn[0][0]                        
__________________________________________________________________________________________________
time_distributed_2 (TimeDistrib (None, None, 29)     174         batch_normalization_1[0][0]      
__________________________________________________________________________________________________
input_length (InputLayer)       [(None, 1)]          0                                            
__________________________________________________________________________________________________
softmax (Activation)            (None, None, 29)     0           time_distributed_2[0][0]         
__________________________________________________________________________________________________
the_labels (InputLayer)         [(None, None)]       0                                            
__________________________________________________________________________________________________
lambda_5 (Lambda)               (None, 1)            0           input_length[0][0]               
__________________________________________________________________________________________________
label_length (InputLayer)       [(None, 1)]          0                                            
__________________________________________________________________________________________________
ctc (Lambda)                    (None, 1)            0           softmax[0][0]                    
                                                                 the_labels[0][0]                 
                                                                 lambda_5[0][0]                   
                                                                 label_length[0][0]               
==================================================================================================
Total params: 689
Trainable params: 679
Non-trainable params: 10
__________________________________________________________________________________________________